# ZoneUseHumidificationSetpointParam Property

---
C#Visual BasicVisual C++
Revit 2024 API
---
ParameterTypeId..::..ZoneUseHumidificationSetpointParam Property
ParameterTypeId Class See Also
---
"Use Humidification Set Point"
**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
# Syntax
C#
---
```text
public static ForgeTypeId ZoneUseHumidificationSetpointParam { get; }
```

Visual Basic
---
```text
Public Shared ReadOnly Property ZoneUseHumidificationSetpointParam As ForgeTypeId
	Get
```

Visual C++
---
```text
public:
static property ForgeTypeId^ ZoneUseHumidificationSetpointParam {
	ForgeTypeId^ get ();
}
```

# See Also
ParameterTypeId Class
Autodesk.Revit.DB Namespace